package homeworks.hw_32.Task2;

import homeworks.hw_32.Task0.MyArrayList;

/*** Author: Roman Romashko Date: 13.03.2025 ***/

/*
Task 2. * Опционально
Обобщенный статический метод “Печать двух списков”
Напишите обобщенный статический метод printTwoLists, который принимает два параметра типа MyArrayList и MyArrayList<U>, и выводит элементы обоих списков.

Требования:

Метод должен быть обобщенным по двум типам T и U.
Элементы списков могут быть разных типов.
Пример использования:

MyArrayList<String> names = new MyArrayList<>();
names.add("Alice");
names.add("Bob");

MyArrayList<Integer> scores = new MyArrayList<>();
scores.add(85);
scores.add(92);

printTwoLists(names, scores);
Copy
Вывод:

Alice
Bob
85
92
 */

class Utils {
    public static <T, U> void printTwoLists(MyArrayList<T> list1, MyArrayList<U> list2) {

        for (int i = 0; i < list1.size(); i++) {
            System.out.println(list1.get(i));
        }
        for (int i = 0; i < list2.size(); i++) {
            System.out.println(list2.get(i));
        }

    }
}