package homeworks.hw_26;

/*** Author: Roman Romashko Date: 05.03.2025 ***/

public class Quiz {

    /*

    С помощью какого механизма можно избежать дублирование кода в двух разных классах?

    С помощью extends

    A extends B - где предок?

     B - предок
     А - потомок

     С помощью какого модификатора можно сделать так, чтобы метод и ли поле были доступны в потомке?

     - protected
     - public

     Какие элементы класса предка копируются в классы потомки?

      - поля
      - методы
      - не копируются только конструкторы

      Как принудительно вызвать конструктор предка в конструктору потомка?

      - super()

      Что будет, если в конструкторе потомка не вызвать явно конструктор предка?

      - Java попытается вызвать пустой конструктор предка (super())
      - А если такого конструктора нет - будет ошибка компиляции - программа не запустится




     */
}
