package lesson11;

// Ctrl + / - закомментировать строку
//На компьютере будет создан файл Hello.java

// Функция в Python = метод в Java - это набор инструкций, который выполняется вместе
// Метод main - это специальный метод, который говорит Java, с чего начинать выполнять программу

// /* ... */ - Многострочный комментарий - аналог """ ... """ в Python язык2

public class Hello {

    /*
    1. Команда 1
    2. Команда 2
    */


    // 1.psvm; 2.main
    // Метод main - стартовая точка программы
    public static void main(String[] args) {
        System.out.println("Hello, World!");
        // Ctrl + Y - удаление строки

    }

    /*
    public static void main (String[] args){
        // Мы можем написать инструкции, которые будут выполнены, при запуске класса Hello

    }
    */
}

